In [18]:
import pandas as pd
from geopy.geocoders import Nominatim

In [19]:
import os
os.getcwd()

'C:\\Users\\samir saiyed\\Lattitude & Longitude'

In [21]:
df = pd.read_csv("data1.csv", sep=',')

In [23]:
df.head()

,CITY,STREET_ADDRESS,STATE,COUNTRY,DISTRICT,COUNTRY.1,POSTCODE
0,Abohar,NaN,Punjab,India,NaN,NaN,NaN
1,Adilabad,NaN,Telangana,India,NaN,NaN,NaN
2,Agartala,NaN,Tripura,India,NaN,NaN,NaN
3,Agra,NaN,Uttar Pradesh,India,NaN,NaN,NaN
4,Ahmadnagar,NaN,Maharashtra,India,NaN,NaN,NaN

In [24]:
df['query'] = df['CITY'] + " " + df['STATE'] + " " +  df['COUNTRY']

In [25]:
df['query']

0                    Abohar Punjab India
1               Adilabad Telangana India
2                 Agartala Tripura India
3               Agra Uttar Pradesh India
4           Ahmadnagar Maharashtra India
                     ...
208    Vizianagaram Andhra Pradesh India
209             Warangal Telangana India
210           Jorapokhar Jharkhand India
211            Brajrajnagar Odisha India
212                 Talcher Odisha India
Name: query, Length: 213, dtype: object

In [26]:
df.drop_duplicates(subset ='query', keep ='first', inplace = True)

In [27]:
df.shape

(213, 8)

In [28]:
df.head()

,CITY,STREET_ADDRESS,STATE,COUNTRY,DISTRICT,COUNTRY.1,POSTCODE,query
0,Abohar,NaN,Punjab,India,NaN,NaN,NaN,Abohar Punjab India
1,Adilabad,NaN,Telangana,India,NaN,NaN,NaN,Adilabad Telangana India
2,Agartala,NaN,Tripura,India,NaN,NaN,NaN,Agartala Tripura India
3,Agra,NaN,Uttar Pradesh,India,NaN,NaN,NaN,Agra Uttar Pradesh India
4,Ahmadnagar,NaN,Maharashtra,India,NaN,NaN,NaN,Ahmadnagar Maharashtra India

In [29]:
df = df.drop(columns=['DISTRICT','COUNTRY.1','POSTCODE','STREET_ADDRESS'])

In [30]:
df.head()

         CITY          STATE COUNTRY                         query
0      Abohar         Punjab   India           Abohar Punjab India
1    Adilabad      Telangana   India      Adilabad Telangana India
2    Agartala        Tripura   India        Agartala Tripura India
3        Agra  Uttar Pradesh   India      Agra Uttar Pradesh India
4  Ahmadnagar    Maharashtra   India  Ahmadnagar Maharashtra India

In [31]:
df['location_lat'] = ""
df['location_long'] = ""
df['location_address'] = ""

df.head()

,CITY,STATE,COUNTRY,query,location_lat,location_long,location_address
0,Abohar,Punjab,India,Abohar Punjab India,,,
1,Adilabad,Telangana,India,Adilabad Telangana India,,,
2,Agartala,Tripura,India,Agartala Tripura India,,,
3,Agra,Uttar Pradesh,India,Agra Uttar Pradesh India,,,
4,Ahmadnagar,Maharashtra,India,Ahmadnagar Maharashtra India,,,

In [ ]:
geolocator = Nominatim(user_agent="myApp")

for i in df.index:
    try:
        location = geolocator.geocode(df['query'][i])
        
        df.loc[i,'location_lat'] = location.latitude
        df.loc[i,'location_long'] = location.longitude
        df.loc[i,'location_address'] = location.address
    except:
        df.loc[i,'location_lat'] = ""
        df.loc[i,'location_long'] = ""
        df.loc[i,'location_address'] = ""


df.head()

In [14]:
df.to_csv('selected_data.csv')